#1. Квадрат числа.
#Користувач вводить число. Програма виводить його квадрат.
#Приклад:
#Введіть число: 5
#Квадрат числа: 25

# Первое задание
number = int(input("Введите число: "))
amswer = (number ** 2)
print("Ваше чимло в квадрате: ", amswer)

#Програма запитує три числа і виводить їх середнє арифметичне.
#Приклад:
#Введіть три числа: 2, 4, 6
#Середнє: 4.0

#Второе задание
numbers = list(map(int, input("Введите три числа: ").split()))
print("Ваши цифры: " , numbers[0], numbers[1], numbers[2])
answer = (numbers[0] + numbers[1] + numbers[2]) / 3
print("Среднее значение: ", round(answer))

#3. “Перетворення хвилин у години”
#Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
#Приклад:
#Введіть кількість хвилин: 135
#2 години 15 хвилин
minets = int(input("Ввкдите количество минут: "))
divmod(minets, 60)
hours, minutes = divmod(minets, 60)
print(hours, "час", minutes, "минут")


#4. “Розрахунок знижки”
#Користувач вводить ціну товару і розмір знижки у %.
#Програма виводить кінцеву ціну.
#Приклад:
#Введіть ціну: 1000
#Введіть знижку (%): 15
#Ціна зі знижкою: 850.0

price = int(input("Введите цену товара: "))
discount = int(input("Введите размер скидки: "))
discount_price = price * discount / 100
last_price = price - discount_price
print("Итоговая цена: ", last_price)

#5. “Остання цифра числа”
#Користувач вводить ціле число, програма виводить його останню цифру.
#Приклад:
#Введіть число: 347
#Остання цифра: 7

number = int(input("Ввкдите число: "))
answer = number % 10
print("Последняя цифра: ", answer)

#6. “Периметр прямокутника”
#Користувач вводить довжину і ширину. Програма виводить периметр.
#Приклад:
#Введіть довжину: 5
#Введіть ширину: 3
#Периметр: 16

print("Найдем площадь прямоугольника")
a_side = int(input("Введите длину: "))
b_side = int(input("Введите ширину: "))
squar = a_side * b_side
print("Площадь : ", squar)

#7. Виведення числа в стовпчик
#Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
#1
#2
#3
#4

number = int(input("Ввкдите 4х значное число: "))
answer_a = number // 1000
answer_b = (number % 1000) // 100
answer_c = (number % 100) // 10
answer_d = number % 10
print(answer_a)
print(answer_b)
print(answer_c)
print(answer_d)