import random
things_in_the_room = ["письменный стол","кресло","книжный шкаф", "сейф", "камин", "картина", "часы", "ваза", "ковёр", "окно", "дверь", "разбитый стакан", "окровавленный носовой платок", "следы грязи на полу" ]
room_items = {
    "письменный стол",
    "кресло",
    "книжный шкаф",
    "сейф",
    "камин",
    "картина",
    "часы",
    "ваза",
    "ковёр",
    "окно",
    "дверь",
    "разбитый стакан",
    "окровавленный носовой платок",
    "следы грязи на полу"
}
def examine_room(room_items):
    for item in room_items():
        print("В комнате вы нашли: ", item)








while True:
   print("1. Осмотреть комнату")
   print("2. Допросить подозреваемого")
   print("3. Посмотреть найденные улики")
   print("4. Обвинить подозреваемого")
   print("5. Выйти")
   try:
       answer = int(input("Выберите действие: "))
   except ValueError:
       print("Ошибка!")
       continue
   if answer == 1:
       examine_room(room_items)